InformationRegisters/ВыходныеДни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВыходныеДни</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоРабочихЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Интервалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Интервалы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/омДаты/Ext/Module.bsl
&НаСервере
Процедура ЗаполнитьМесяцы() Экспорт
	ПустаяСсылка = Справочники.Месяцы.ПустаяСсылка();
	
	Если Справочники.Месяцы.НайтиПоКоду(1) = ПустаяСсылка Тогда
		СпрОб = Справочники.Месяцы.СоздатьЭлемент();
		СпрОб.Код = 1;
		СпрОб.Наименование = "Январь";
		СпрОб.Записать();
	КонецЕсли; 
	
	Если Справочники.Месяцы.НайтиПоКоду(2) = ПустаяСсылка Тогда
		СпрОб = Справочники.Месяцы.СоздатьЭлемент();
		СпрОб.Код = 2;
		СпрОб.Наименование = "Февраль";
		СпрОб.Записать();
	КонецЕсли; 
	
	Если Справочники.Месяцы.НайтиПоКоду(3) = ПустаяСсылка Тогда
		СпрОб = Справочники.Месяцы.СоздатьЭлемент();
		СпрОб.Код = 3;
		СпрОб.Наименование = "Март";
		СпрОб.Записать();
	КонецЕсли; 
	
	Если Справочники.Месяцы.НайтиПоКоду(4) = ПустаяСсылка Тогда
		СпрОб = Справочники.Месяцы.СоздатьЭлемент();
		СпрОб.Код = 4;
		СпрОб.Наименование = "Апрель";
		СпрОб.Записать();
	КонецЕсли; 
	
	Если Справочники.Месяцы.НайтиПоКоду(5) = ПустаяСсылка Тогда
		СпрОб = Справочники.Месяцы.СоздатьЭлемент();
		СпрОб.Код = 5;
		СпрОб.Наименование = "Май";
		СпрОб.Записать();
	КонецЕсли; 
	
	Если Справочники.Месяцы.НайтиПоКоду(6) = ПустаяСсылка Тогда
		СпрОб = Справочники.Месяцы.СоздатьЭлемент();
		СпрОб.Код = 6;
		СпрОб.Наименование = "Июнь";
		СпрОб.Записать();
	КонецЕсли; 
	
	Если Справочники.Месяцы.НайтиПоКоду(7) = ПустаяСсылка Тогда
		СпрОб = Справочники.Месяцы.СоздатьЭлемент();
		СпрОб.Код = 7;
		СпрОб.Наименование = "Июль";
		СпрОб.Записать();
	КонецЕсли; 
	
	Если Справочники.Месяцы.НайтиПоКоду(8) = ПустаяСсылка Тогда
		СпрОб = Справочники.Месяцы.СоздатьЭлемент();
		СпрОб.Код = 8;
		СпрОб.Наименование = "Август";
		СпрОб.Записать();
	КонецЕсли; 
	
	Если Справочники.Месяцы.НайтиПоКоду(9) = ПустаяСсылка Тогда
		СпрОб = Справочники.Месяцы.СоздатьЭлемент();
		СпрОб.Код = 9;
		СпрОб.Наименование = "Сентябрь";
		СпрОб.Записать();
	КонецЕсли; 
	
	Если Справочники.Месяцы.НайтиПоКоду(10) = ПустаяСсылка Тогда
		СпрОб = Справочники.Месяцы.СоздатьЭлемент();
		СпрОб.Код = 10;
		СпрОб.Наименование = "Октябрь";
		СпрОб.Записать();
	КонецЕсли; 
	
	Если Справочники.Месяцы.НайтиПоКоду(11) = ПустаяСсылка Тогда
		СпрОб = Справочники.Месяцы.СоздатьЭлемент();
		СпрОб.Код = 11;
		СпрОб.Наименование = "Ноябрь";
		СпрОб.Записать();
	КонецЕсли; 
	
	Если Справочники.Месяцы.НайтиПоКоду(12) = ПустаяСсылка Тогда
		СпрОб = Справочники.Месяцы.СоздатьЭлемент();
		СпрОб.Код = 12;
		СпрОб.Наименование = "Декабрь";
		СпрОб.Записать();
	КонецЕсли; 
	

КонецПроцедуры // ЗаполнитьМесяцы()
 
&НаСервере
Функция ПолучитьРабочиеДни(ДатаН, ДатаК = Неопределено, БезУчетаВыходных = Ложь) Экспорт
	
	Если ДатаК = Неопределено Тогда
		ДатаК = КонецМесяца(ДатаН);
	КонецЕсли;
	
	текДата = НачалоДня(ДатаН);
	
	тзРабочиеЧасы = Новый ТаблицаЗначений;
	тзРабочиеЧасы.Колонки.Добавить("Дата",Новый ОписаниеТипов("Дата", , ,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	тзРабочиеЧасы.Колонки.Добавить("РабочиеЧасы",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный)));
	тзРабочиеЧасы.Индексы.Добавить("Дата");
	
	Пока текДата < КонецДня(ДатаК) Цикл
		НС = тзРабочиеЧасы.Добавить();
		НС.Дата = текДата;
		НС.РабочиеЧасы = 8;
		
		текДата = текДата + 24 * 3600;
	
	КонецЦикла;
	
	Если НЕ БезУчетаВыходных Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыходныеДни.Дата КАК Дата,
		|	ВыходныеДни.КоличествоРабочихЧасов КАК КоличествоРабочихЧасов
		|ИЗ
		|	РегистрСведений.ВыходныеДни КАК ВыходныеДни
		|ГДЕ
		|	ВыходныеДни.Дата МЕЖДУ &ДатаН И &ДатаК";
		
		Запрос.УстановитьПараметр("ДатаК", ДатаК);
		Запрос.УстановитьПараметр("ДатаН", ДатаН);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			тзРабочиеЧасы.Найти(Выборка.Дата,"Дата").РабочиеЧасы = Выборка.КоличествоРабочихЧасов;
		КонецЦикла;
	КонецЕсли;
	
	
	Возврат тзРабочиеЧасы;
КонецФункции // ПолучитьРабочиеДни()
 
&НаСервере
Функция ДобавитьДниСУчетомВыходных(текДата,СмещениеВДнях) Экспорт
	
	СекундВСутках = 24 * 3600;
	СмещениеВСекундах = СмещениеВДнях * СекундВСутках; 
	
	Если СмещениеВДнях > 0 Тогда
		ДатаНачала 				= текДата;
		ДатаОкончания 			= текДата + СмещениеВСекундах;
		ИнтералПолученияДаты 	= ДатаОкончания;
		
	ИначеЕсли СмещениеВДнях = 0 Тогда
    	Возврат текДата;
	Иначе
		ДатаОкончания 			= текДата;
		ДатаНачала 				= текДата + СмещениеВСекундах;
		ИнтералПолученияДаты 	= ДатаНачала;
		
	КонецЕсли;
	
	Возврат ПолучитьРасчетнуюДату(ДатаНачала,ДатаОкончания,ИнтералПолученияДаты,СмещениеВСекундах,СекундВСутках);
КонецФункции // ДобавитьДниСУчетомВыходных() 

&НаСервере
Функция ПолучитьСледующийРабочийДень(ТекущийДень) Экспорт
	СледующийДень = НачалоДня(ТекущийДень) + 86400;
	
	тзДаты = ПолучитьРабочиеДни(СледующийДень, СледующийДень + 86400 * 30); 	
	
	Для каждого текДата Из тзДаты Цикл
		Если текДата.РабочиеЧасы > 0 Тогда
			Возврат текДата.Дата;
		КонецЕсли;
	КонецЦикла;
	Возврат СледующийДень;
	
	
КонецФункции // ПолучитьСледующийРабочийДень()

&НаСервере
Функция ПолучитьПредыдущийРабочийДень(ТекущийДень) Экспорт
	ПредыдущийДень = НачалоДня(ТекущийДень) - 86400;
	
	тзДаты = ПолучитьРабочиеДни(ПредыдущийДень - 86400 * 30, ПредыдущийДень); 

	тзДаты.Сортировать("Дата Убыв");

	Для каждого текДата Из тзДаты Цикл
		Если текДата.РабочиеЧасы > 0 Тогда
			Возврат текДата.Дата;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПредыдущийДень;

КонецФункции // ПолучитьСледующийРабочийДень()

&НаСервере
Функция ПолучитьРасчетнуюДату(ДатаНачала,ДатаОкончания,ИнтералПолученияДаты,СмещениеВСекундах,СекундВСутках,тзРабочиеЧасы = Неопределено)
	
	тзРабочиеЧасы  = ПолучитьРабочиеДни(ДатаНачала,ДатаОкончания);
	КоличествоВыходных = ПолучитьКоличествоВыходных(ДатаНачала,ДатаОкончания,тзРабочиеЧасы,СекундВСутках);
	
	Если КоличествоВыходных = 0 Тогда
		Возврат ?(СмещениеВСекундах > 0,ДатаОкончания,ДатаНачала);
	КонецЕсли;
	
	Если СмещениеВСекундах > 0 Тогда
		ДатаНачала 		= ДатаОкончания + СекундВСутках;	
		ДатаОкончания 	= ДатаОкончания + КоличествоВыходных * СекундВСутках;	
	Иначе
		ДатаОкончания 	= ДатаНачала - СекундВСутках;	
		ДатаНачала 		= ДатаНачала - КоличествоВыходных * СекундВСутках;	
	КонецЕсли;
	ПолучитьРасчетнуюДату(ДатаНачала,ДатаОкончания,ИнтералПолученияДаты,СмещениеВСекундах,СекундВСутках,тзРабочиеЧасы);
	
	Возврат ?(СмещениеВСекундах > 0,ДатаОкончания,ДатаНачала);
	
КонецФункции // ПодсчитатьКоличествоДней()

&НаСервере
Функция ПолучитьКоличествоВыходных(ДатаНачала,ДатаОкончания,тзРабочиеЧасы,СекундВСутках)

	текДата = ДатаНачала; 
	КоличествоВыходных = 0;
	Пока текДата <= ДатаОкончания Цикл
		НайденаяСтрока = тзРабочиеЧасы.Найти(текДата,"Дата");
		
		Если НайденаяСтрока = Неопределено Тогда
			текДата = текДата + СекундВСутках;
			Продолжить; 
		КонецЕсли;
		
		Если НайденаяСтрока.РабочиеЧасы = 0 Тогда
			КоличествоВыходных = КоличествоВыходных + 1;
		КонецЕсли;
		
		текДата = текДата + СекундВСутках;
	КонецЦикла;
	
	Возврат КоличествоВыходных;
КонецФункции // ПолучитьКоличествоВыходных()

&НаСервере
Функция КоличествоРабочихДней(Дата1, Дата2) Экспорт
	стДаты = ДатыПоПорядку(Дата1, Дата2);
	Если стДаты.ДатыРавны Тогда
		Возврат 0;
	КонецЕсли;
	
	ДатаН = НачалоДня(стДаты.ДатаНачала);
	ДатаК = НачалоДня(стДаты.ДатаОкончания);
	Возврат (ДатаК - ДатаН) / (3600 * 24) - КоличествоВыходных(ДатаН, ДатаК);
КонецФункции // КоличествоРабочихДней()

&НаСервере
Функция КоличествоВыходных(ДатаН, ДатаК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыходныеДни.Дата) КАК Дата
		|ИЗ
		|	РегистрСведений.ВыходныеДни КАК ВыходныеДни
		|ГДЕ
		|	ВыходныеДни.Дата МЕЖДУ &ДатаН И &ДатаК
		|	И ВыходныеДни.КоличествоРабочихЧасов = 0";
	
	Запрос.УстановитьПараметр("ДатаК", ДатаК);
	Запрос.УстановитьПараметр("ДатаН", ДатаН);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Дата;
	КонецЦикла;
	
    Возврат 0;

КонецФункции // КоличествоВыходных(Дата1, Дата2)

&НаСервере
Функция ДатыПоПорядку(Дата1, Дата2, ПолноеРавенство = Ложь) Экспорт
	
	стВозврата = Новый Структура("ДатыРавны,ДатаНачала,ДатаОкончания",Ложь);
	
	Если ПолноеРавенство Тогда
		Если Дата1 = Дата2 Тогда
			стВозврата.ДатыРавны = Истина;
		КонецЕсли;
	Иначе
		Если НачалоДня(Дата1) = НачалоДня(Дата2) Тогда
			стВозврата.ДатыРавны = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Дата1 > Дата2 Тогда
		стВозврата.ДатаНачала 	= Дата2;
		стВозврата.ДатаОкончания = Дата1;
	ИначеЕсли Дата1 < Дата2 Тогда
		стВозврата.ДатаНачала 	= Дата1;
		стВозврата.ДатаОкончания = Дата2;
	КонецЕсли;
	
    Возврат  стВозврата;
КонецФункции // ДатыПоПорядку(Дата1, Дата2)

&НаСервере
Функция ПолучитьДатуОтИнтервала(Интервал,ДатаНачала,Вперед = Истина) Экспорт
	
	СекундВДне = 3600 * 24;
	
	Если Вперед Тогда
		Если Интервал = Перечисления.Интервалы.День Тогда
			Возврат КонецДня(ДатаНачала);
		ИначеЕсли Интервал = Перечисления.Интервалы.Неделя Тогда
			Возврат КонецДня(ДатаНачала + СекундВДне * 6);
		ИначеЕсли Интервал = Перечисления.Интервалы.Месяц Тогда
			Возврат КонецДня(ДобавитьМесяц(ДатаНачала,1) - СекундВДне);	
		ИначеЕсли Интервал = Перечисления.Интервалы.Год Тогда
			Возврат КонецДня(ДобавитьМесяц(ДатаНачала,12) - СекундВДне);	
		КонецЕсли;                                                                                         
		
		Возврат КонецДня(ДатаНачала + СекундВДне * 7);
	Иначе
		Если Интервал = Перечисления.Интервалы.День Тогда
			Возврат НачалоДня(ДатаНачала);
		ИначеЕсли Интервал = Перечисления.Интервалы.Неделя Тогда
			Возврат НачалоДня(ДатаНачала - СекундВДне * 6);
		ИначеЕсли Интервал = Перечисления.Интервалы.Месяц Тогда
			Возврат НачалоДня(ДобавитьМесяц(ДатаНачала,-1) + СекундВДне);	
		ИначеЕсли Интервал = Перечисления.Интервалы.Год Тогда
			Возврат НачалоДня(ДобавитьМесяц(ДатаНачала,-12) + СекундВДне);	
		КонецЕсли;
		
		Возврат НачалоДня(ДатаНачала - СекундВДне * 7);
	КонецЕсли; 
	
	
КонецФункции // ПолучитьСмещениеВДняхОтПериода()
